server/app/controllers/app_controller.rb

SELECT "services".* FROM "services" ORDER BY "services"."service_type" ASC, "services"."position" ASC
---
  def state
    render json: {
      services: Service.order(:service_type, :position).as_json,
      extras: Extra.all.as_json,
    }