server/app/controllers/create_controller.rb

  def order
    service = Service.find_by(
      service_type: params[:params][:service],
      position: params[:params][:position],
    )

    order = service.current_order ||
      service.orders.create!(start_time: Time.current)
---
SELECT  "services".* FROM "services" WHERE "services"."service_type" = $1 AND "services"."position" = $2 LIMIT $3  [["service_type", 0], ["position", 3], ["LIMIT", 1]]
INSERT INTO "orders" ("service_id", "start_time") VALUES ($1, $2) RETURNING "id"  [["service_id", 3], ["start_time", "2018-05-18 18:59:03.827293"]]